[{"repository": "https://github.com/Akshaj000/NaiveBayesClassifier_CropRecommender", "title": "Crop Recommeder which recommends crop using Naive Bayes Classifier", "description": "This is a python notebook where i experimented multiple algorithm such as naive bayes, random forest and descision tree to predict the best crop based on some features. I underke a model using sklearn, also implemented a naive bayes classifier from scratch. I watched youtube tutorials to understand the mathematical concept behind this algorithm. This was part of our semester one maths project. I also understood how to clean, visualise, split dataframes.", "image": "https://user-images.githubusercontent.com/83636572/151711244-1592a9fa-fff3-4f25-89cf-4d4d6b756ce2.png"}, {"repository": "https://github.com/Aashray446/DSA_MADE_EASY", "title": "Data Structure Visualiser Using Basic HTML, CSS and JavaScript", "description": "This is our second semster group project from where we learned web development along with data structure concepts. This project can help those who are learning basic data structure and algorithm concept by giving a graphical simulation. This contains Arrays, Binary Tree, Queues, Sorting and Searching Algorithms, Linked Lists.", "image": "https://user-images.githubusercontent.com/83636572/175829112-94aaab54-fd2a-4bab-9f31-6286e33a8e6a.png"}, {"repository": "https://github.com/akshaj000/EcomWebsite_React-Django", "title": "Demo Ecommerce Website Using Reactjs and Django.", "description": "A demo e-commerce website with Reactjs as its front end and Django as its backend. It has payment, add to cart functionalities along with a dedicated view for admin to add and edit products. This helped me learn about rest apis, different CRUD operations, json tokens, react hooks etc", "image": "https://user-images.githubusercontent.com/83636572/154805999-4988cba0-add9-4eb1-a102-cfefd38959cb.png"}, {"repository": "https://github.com/Akshaj000/Forensic-Management-System", "title": "A Demo Management System using OOPS concepts", "description": "This is This is a Forensic Management System implemented using basic Java using object oriented programming concepts. This project helped me understand oops better, taught how to work as team, taught how to write java.", "image": "https://github.com/Akshaj000/Forensic-Management-System/raw/main/Screenshot.png"}]